pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_flpr_peripherals.h
#define TIMER137_CC_NUM_MIN 0
#define TIMER137_CC_NUM_MAX 5
#define TIMER137_CC_NUM_SIZE 6
#define TIMER137_MAX_SIZE_MIN 0
#define TIMER137_MAX_SIZE_MAX 31
#define TIMER137_MAX_SIZE_SIZE 32
#define TIMER137_PCLK_MHZ 16
#define TIMER137_PCLK_VARIABLE 0

/*Pulse width modulation unit*/
#define PWM_PRESENT 1
#define PWM_COUNT 5

#define PWM120_IDLE_OUT 1
#define PWM120_COMPARE_MATCH 1
#define PWM120_FEATURES_V2 0
#define PWM120_NO_FEATURES_V2 1
#define PWM120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define PWM130_IDLE_OUT 1
#define PWM130_COMPARE_MATCH 1
#define PWM130_FEATURES_V2 0
#define PWM130_NO_FEATURES_V2 1
#define PWM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define PWM131_IDLE_OUT 1
#define PWM131_COMPARE_MATCH 1
#define PWM131_FEATURES_V2 0
#define PWM131_NO_FEATURES_V2 1
#define PWM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define PWM132_IDLE_OUT 1
#define PWM132_COMPARE_MATCH 1
#define PWM132_FEATURES_V2 0
#define PWM132_NO_FEATURES_V2 1
#define PWM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define PWM133_IDLE_OUT 1
#define PWM133_COMPARE_MATCH 1
#define PWM133_FEATURES_V2 0
#define PWM133_NO_FEATURES_V2 1
#define PWM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

/*SPI Slave*/
#define SPIS_PRESENT 1
#define SPIS_COUNT 9

#define SPIS120_EASYDMA_MAXCNT_MIN 0
#define SPIS120_EASYDMA_MAXCNT_MAX 14
#define SPIS120_EASYDMA_MAXCNT_SIZE 15
#define SPIS120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS130_EASYDMA_MAXCNT_MIN 0
#define SPIS130_EASYDMA_MAXCNT_MAX 14
#define SPIS130_EASYDMA_MAXCNT_SIZE 15
#define SPIS130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS131_EASYDMA_MAXCNT_MIN 0
#define SPIS131_EASYDMA_MAXCNT_MAX 14
#define SPIS131_EASYDMA_MAXCNT_SIZE 15
#define SPIS131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS132_EASYDMA_MAXCNT_MIN 0
#define SPIS132_EASYDMA_MAXCNT_MAX 14
#define SPIS132_EASYDMA_MAXCNT_SIZE 15
#define SPIS132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS133_EASYDMA_MAXCNT_MIN 0
#define SPIS133_EASYDMA_MAXCNT_MAX 14
#define SPIS133_EASYDMA_MAXCNT_SIZE 15
#define SPIS133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS134_EASYDMA_MAXCNT_MIN 0
#define SPIS134_EASYDMA_MAXCNT_MAX 14
#define SPIS134_EASYDMA_MAXCNT_SIZE 15
#define SPIS134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS135_EASYDMA_MAXCNT_MIN 0
#define SPIS135_EASYDMA_MAXCNT_MAX 14
#define SPIS135_EASYDMA_MAXCNT_SIZE 15
#define SPIS135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS136_EASYDMA_MAXCNT_MIN 0
#define SPIS136_EASYDMA_MAXCNT_MAX 14
#define SPIS136_EASYDMA_MAXCNT_SIZE 15
#define SPIS136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS137_EASYDMA_MAXCNT_MIN 0
#define SPIS137_EASYDMA_MAXCNT_MAX 14
#define SPIS137_EASYDMA_MAXCNT_SIZE 15
#define SPIS137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

/*Serial Peripheral Interface Master with EasyDMA*/
#define SPIM_PRESENT 1
#define SPIM_COUNT 10

#define SPIM120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM120_MAX_DATARATE 32
#define SPIM120_EASYDMA_MAXCNT_MIN 0
#define SPIM120_EASYDMA_MAXCNT_MAX 14
#define SPIM120_EASYDMA_MAXCNT_SIZE 15
#define SPIM120_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM120_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM120_FEATURE_RXDELAY_PRESENT 1
#define SPIM120_STALL_STATUS_PRESENT 0
#define SPIM120_STALL_STATUS_TX_PRESENT 0
#define SPIM120_NUM_CHIPSELECT_MIN 0
#define SPIM120_NUM_CHIPSELECT_MAX 0
#define SPIM120_NUM_CHIPSELECT_SIZE 1
#define SPIM120_CORE_FREQUENCY 320
#define SPIM120_PRESCALER_PRESENT 1
#define SPIM120_PRESCALER_DIVISOR_RANGE_MIN 4
#define SPIM120_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM120_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM120_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM120_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM120_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM120_RXDELAY_RESET_VALUE 2
#define SPIM120_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM120_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM120_RXDELAY_FIELD_WIDTH_SIZE 3

#define SPIM121_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM121_MAX_DATARATE 32
#define SPIM121_EASYDMA_MAXCNT_MIN 0
#define SPIM121_EASYDMA_MAXCNT_MAX 14
#define SPIM121_EASYDMA_MAXCNT_SIZE 15
#define SPIM121_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM121_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM121_FEATURE_RXDELAY_PRESENT 1
#define SPIM121_STALL_STATUS_PRESENT 0
#define SPIM121_STALL_STATUS_TX_PRESENT 0
#define SPIM121_NUM_CHIPSELECT_MIN 0
#define SPIM121_NUM_CHIPSELECT_MAX 0
#define SPIM121_NUM_CHIPSELECT_SIZE 1
#define SPIM121_CORE_FREQUENCY 320
#define SPIM121_PRESCALER_PRESENT 1
#define SPIM121_PRESCALER_DIVISOR_RANGE_MIN 4
#define SPIM121_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM121_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM121_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM121_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM121_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM121_RXDELAY_RESET_VALUE 2
#define SPIM121_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM121_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM121_RXDELAY_FIELD_WIDTH_SIZE 3

#define SPIM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM130_MAX_DATARATE 8
#define SPIM130_EASYDMA_MAXCNT_MIN 0
#define SPIM130_EASYDMA_MAXCNT_MAX 14
#define SPIM130_EASYDMA_MAXCNT_SIZE 15
#define SPIM130_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM130_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM130_FEATURE_RXDELAY_PRESENT 1
#define SPIM130_STALL_STATUS_PRESENT 0
#define SPIM130_STALL_STATUS_TX_PRESENT 0
#define SPIM130_NUM_CHIPSELECT_MIN 0
#define SPIM130_NUM_CHIPSELECT_MAX 0
#define SPIM130_NUM_CHIPSELECT_SIZE 1
#define SPIM130_CORE_FREQUENCY 16
#define SPIM130_PRESCALER_PRESENT 1
#define SPIM130_PRESCALER_DIVISOR_RANGE_MIN 2
#define SPIM130_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM130_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM130_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM130_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM130_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM130_RXDELAY_RESET_VALUE 2
#define SPIM130_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM130_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM130_RXDELAY_FIELD_WIDTH_SIZE 3

