pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_flpr_peripherals.h
#define P6_CTRLSEL_MAP1 1
#define P6_CTRLSEL_MAP2 0
#define P6_CTRLSEL_MAP3 0
#define P6_PIN_NUM_MIN 0
#define P6_PIN_NUM_MAX 13
#define P6_PIN_NUM_SIZE 14
#define P6_FEATURE_PINS_PRESENT 0x00003FFFUL
#define P6_DRIVECTRL 1
#define P6_RETAIN 1
#define P6_PWRCTRL 0
#define P6_PIN_OWNER_SEC 0
#define P6_BIASCTRL 0

#define P8_CTRLSEL_MAP1 1
#define P8_CTRLSEL_MAP2 0
#define P8_CTRLSEL_MAP3 0
#define P8_PIN_NUM_MIN 0
#define P8_PIN_NUM_MAX 4
#define P8_PIN_NUM_SIZE 5
#define P8_FEATURE_PINS_PRESENT 0x0000001FUL
#define P8_DRIVECTRL 1
#define P8_RETAIN 1
#define P8_PWRCTRL 0
#define P8_PIN_OWNER_SEC 0
#define P8_BIASCTRL 0

#define P9_CTRLSEL_MAP1 1
#define P9_CTRLSEL_MAP2 0
#define P9_CTRLSEL_MAP3 0
#define P9_PIN_NUM_MIN 0
#define P9_PIN_NUM_MAX 5
#define P9_PIN_NUM_SIZE 6
#define P9_FEATURE_PINS_PRESENT 0x0000003FUL
#define P9_DRIVECTRL 0
#define P9_RETAIN 1
#define P9_PWRCTRL 1
#define P9_PIN_OWNER_SEC 0
#define P9_BIASCTRL 0

#define P10_CTRLSEL_MAP1 1
#define P10_CTRLSEL_MAP2 0
#define P10_CTRLSEL_MAP3 0
#define P10_PIN_NUM_MIN 0
#define P10_PIN_NUM_MAX 7
#define P10_PIN_NUM_SIZE 8
#define P10_FEATURE_PINS_PRESENT 0x000000FFUL
#define P10_DRIVECTRL 0
#define P10_RETAIN 1
#define P10_PWRCTRL 0
#define P10_PIN_OWNER_SEC 0
#define P10_BIASCTRL 0

#define P11_CTRLSEL_MAP1 1
#define P11_CTRLSEL_MAP2 0
#define P11_CTRLSEL_MAP3 0
#define P11_PIN_NUM_MIN 0
#define P11_PIN_NUM_MAX 7
#define P11_PIN_NUM_SIZE 8
#define P11_FEATURE_PINS_PRESENT 0x000000FFUL
#define P11_DRIVECTRL 0
#define P11_RETAIN 1
#define P11_PWRCTRL 0
#define P11_PIN_OWNER_SEC 0
#define P11_BIASCTRL 0

#define P12_CTRLSEL_MAP1 1
#define P12_CTRLSEL_MAP2 0
#define P12_CTRLSEL_MAP3 0
#define P12_PIN_NUM_MIN 0
#define P12_PIN_NUM_MAX 2
#define P12_PIN_NUM_SIZE 3
#define P12_FEATURE_PINS_PRESENT 0x00000007UL
#define P12_DRIVECTRL 0
#define P12_RETAIN 1
#define P12_PWRCTRL 0
#define P12_PIN_OWNER_SEC 0
#define P12_BIASCTRL 0

#define P13_CTRLSEL_MAP1 1
#define P13_CTRLSEL_MAP2 0
#define P13_CTRLSEL_MAP3 0
#define P13_PIN_NUM_MIN 0
#define P13_PIN_NUM_MAX 3
#define P13_PIN_NUM_SIZE 4
#define P13_FEATURE_PINS_PRESENT 0x0000000FUL
#define P13_DRIVECTRL 0
#define P13_RETAIN 1
#define P13_PWRCTRL 0
#define P13_PIN_OWNER_SEC 0
#define P13_BIASCTRL 0

/*Analog to Digital Converter*/
#define SAADC_PRESENT 1
#define SAADC_COUNT 1

#define SAADC_PSEL_V2 1
#define SAADC_TASKS_CALIBRATEGAIN 0
#define SAADC_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0

/*Comparator*/
#define COMP_PRESENT 1
#define COMP_COUNT 1

/*Low-power comparator*/
#define LPCOMP_PRESENT 1
#define LPCOMP_COUNT 1

/*Temperature Sensor*/
#define TEMP_PRESENT 1
#define TEMP_COUNT 1

/*Inter-IC Sound*/
#define I2S_PRESENT 1
#define I2S_COUNT 2

/*Pulse Density Modulation (Digital Microphone) Interface*/
#define PDM_PRESENT 1
#define PDM_COUNT 1

#define PDM_SAMPLE16 1
#define PDM_SAMPLE48 0
#define PDM_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

/*Quadrature Decoder*/
#define QDEC_PRESENT 1
#define QDEC_COUNT 2

/*I2C compatible Two-Wire Master Interface with EasyDMA*/
#define TWIM_PRESENT 1
#define TWIM_COUNT 8

#define TWIM130_EASYDMA_MAXCNT_MIN 0
#define TWIM130_EASYDMA_MAXCNT_MAX 14
#define TWIM130_EASYDMA_MAXCNT_SIZE 15
#define TWIM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIM131_EASYDMA_MAXCNT_MIN 0
#define TWIM131_EASYDMA_MAXCNT_MAX 14
#define TWIM131_EASYDMA_MAXCNT_SIZE 15
#define TWIM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIM132_EASYDMA_MAXCNT_MIN 0
#define TWIM132_EASYDMA_MAXCNT_MAX 14
#define TWIM132_EASYDMA_MAXCNT_SIZE 15
#define TWIM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIM133_EASYDMA_MAXCNT_MIN 0
#define TWIM133_EASYDMA_MAXCNT_MAX 14
#define TWIM133_EASYDMA_MAXCNT_SIZE 15
#define TWIM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIM134_EASYDMA_MAXCNT_MIN 0
#define TWIM134_EASYDMA_MAXCNT_MAX 14
#define TWIM134_EASYDMA_MAXCNT_SIZE 15
#define TWIM134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIM135_EASYDMA_MAXCNT_MIN 0
#define TWIM135_EASYDMA_MAXCNT_MAX 14
#define TWIM135_EASYDMA_MAXCNT_SIZE 15
#define TWIM135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIM136_EASYDMA_MAXCNT_MIN 0
#define TWIM136_EASYDMA_MAXCNT_MAX 14
#define TWIM136_EASYDMA_MAXCNT_SIZE 15
#define TWIM136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIM137_EASYDMA_MAXCNT_MIN 0
#define TWIM137_EASYDMA_MAXCNT_MAX 14
#define TWIM137_EASYDMA_MAXCNT_SIZE 15
#define TWIM137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

/*I2C compatible Two-Wire Slave Interface with EasyDMA*/
#define TWIS_PRESENT 1
#define TWIS_COUNT 8

#define TWIS130_EASYDMA_MAXCNT_MIN 0
#define TWIS130_EASYDMA_MAXCNT_MAX 14
#define TWIS130_EASYDMA_MAXCNT_SIZE 15
#define TWIS130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIS131_EASYDMA_MAXCNT_MIN 0
#define TWIS131_EASYDMA_MAXCNT_MAX 14
#define TWIS131_EASYDMA_MAXCNT_SIZE 15
#define TWIS131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIS132_EASYDMA_MAXCNT_MIN 0
#define TWIS132_EASYDMA_MAXCNT_MAX 14
#define TWIS132_EASYDMA_MAXCNT_SIZE 15
#define TWIS132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIS133_EASYDMA_MAXCNT_MIN 0
#define TWIS133_EASYDMA_MAXCNT_MAX 14
#define TWIS133_EASYDMA_MAXCNT_SIZE 15
#define TWIS133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIS134_EASYDMA_MAXCNT_MIN 0
#define TWIS134_EASYDMA_MAXCNT_MAX 14
#define TWIS134_EASYDMA_MAXCNT_SIZE 15
#define TWIS134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIS135_EASYDMA_MAXCNT_MIN 0
#define TWIS135_EASYDMA_MAXCNT_MAX 14
#define TWIS135_EASYDMA_MAXCNT_SIZE 15
#define TWIS135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIS136_EASYDMA_MAXCNT_MIN 0
#define TWIS136_EASYDMA_MAXCNT_MAX 14
#define TWIS136_EASYDMA_MAXCNT_SIZE 15
#define TWIS136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define TWIS137_EASYDMA_MAXCNT_MIN 0
#define TWIS137_EASYDMA_MAXCNT_MAX 14
#define TWIS137_EASYDMA_MAXCNT_SIZE 15
#define TWIS137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1


#ifdef __cplusplus
}
#endif
#endif /* NRF9230_ENGB_FLPR_PERIPHERALS_H */

